In [2]:
#Membagi Data Frame Menjadi Dua Secara Acak
#LeonyCornelia-2373002

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

In [8]:
#Persiapan Data Frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size = (n_rows, n_cols)), 
                  columns = cols)
df

    A   B   C   D   E
0  13  17  19   7   2
1   4   4  16   6   7
2  11  14   6   9   2
3  18  19  12  17  12
4  11  15   4  16  11
5  17  16  12  11   2
6  17  10   1  10  16
7  15  13  19   2  11
8   2   8  11  12  10
9  10  10  12  15   2

In [10]:
#Membagi Data Frame Menjadi Dua Secara Acak Berdasarkan Proporsi Tertentu
df.shape

(10, 5)

In [12]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [14]:
df_1

    A   B   C   D   E
9  10  10  12  15   2
1   4   4  16   6   7
7  15  13  19   2  11
0  13  17  19   7   2
6  17  10   1  10  16
4  11  15   4  16  11
3  18  19  12  17  12

In [16]:
df_2

    A   B   C   D   E
2  11  14   6   9   2
5  17  16  12  11   2
8   2   8  11  12  10